redyuan43/VibeStick/firmware/sticks3/sdkconfig.defaults.stickc_plus_se
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# M5StickC Plus SE has the same 4MB flash layout as Plus 1.1.
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_ota_1700k.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions_ota_1700k.csv"
